using UnityEngine;

public class DialogueSystem : MonoBehaviour
{
/*
 * 1. Npc 출력 대화와 유저 선택 대화 저장
 * 2. 데이터 베이스로 그 친구들을 관리(2가지 타입의 대화를 출력 및 저장하여야함) 
 * 3. 클릭하면 대화가 시작되게 해야함
 * 4. 이벤트가 발생하면 선택지의 해당 id 로 넘어가서 관련 선택지가 다 뜨게 해야함
 * 5. 선택지에 따라 어떤 대화로 진행할지 설정해야함
 * 6. 스킵하는 넘버가 있다면 넘어가서 진행하도록 해야함
 * 7. 대화가 다 끝났다면 끝나게 하기
 * 8. 각 오브젝트의 상호작용 정리
 *
 * 1. 엑셀 대이터 정리 (완료)
 * 2. 데이터 클래스 정의 (수정)
 * 3. 데이터 관리 매니저 제작 (수정)
 * 4. 데이터 변환 (수정)
 * 5. dialogue 매니저 (제작)
 *
 * 1. npc를 클릭한다.
 * 2. 이름에 맞는 대화가 시작된다.
 * 3. 선택지에 따라 대화가 변경된다.
 * 
 */
}
